src/main/resources/META-INF/wsdl/TransportCalculatorService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1 (UNKNOWN_BRANCH-false; 2015-01-15T16:53:43+0100) JAXWS-RI/2.2.10 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. -->
<definitions targetNamespace="http://calculator.soap.metro.maxramos.ph/" name="TransportCalculatorService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://calculator.soap.metro.maxramos.ph/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <wsp1_2:Policy wsu:Id="TransportCalculatorPortBindingPolicy" xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702">
    <sp:SupportingTokens>
      <wsp1_2:Policy>
        <sp:UsernameToken sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
          <wsp1_2:Policy>
            <sp:WssUsernameToken11/>
            <ns1:Created xmlns:ns1="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200802"/>
            <ns2:Nonce xmlns:ns2="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200802"/>
          </wsp1_2:Policy>
        </sp:UsernameToken>
      </wsp1_2:Policy>
    </sp:SupportingTokens>
    <sp:TransportBinding>
      <wsp1_2:Policy>
        <sp:AlgorithmSuite>
          <wsp1_2:Policy>
            <sp:Basic128/>
          </wsp1_2:Policy>
        </sp:AlgorithmSuite>
        <sp:IncludeTimestamp/>
        <sp:Layout>
          <wsp1_2:Policy>
            <sp:Strict/>
          </wsp1_2:Policy>
        </sp:Layout>
        <sp:TransportToken>
          <wsp1_2:Policy>
            <sp:HttpsToken/>
          </wsp1_2:Policy>
        </sp:TransportToken>
      </wsp1_2:Policy>
    </sp:TransportBinding>
    <wsam:Addressing/>
  </wsp1_2:Policy>
  <types>
    <xsd:schema>
      <xsd:import namespace="http://calculator.soap.metro.maxramos.ph/" schemaLocation="TransportCalculatorService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="add">
    <part name="parameters" element="tns:add"/>
  </message>
  <message name="addResponse">
    <part name="parameters" element="tns:addResponse"/>
  </message>
  <portType name="TransportCalculator">
    <operation name="add">
      <input wsam:Action="http://calculator.soap.metro.maxramos.ph/TransportCalculator/addRequest" message="tns:add"/>
      <output wsam:Action="http://calculator.soap.metro.maxramos.ph/TransportCalculator/addResponse" message="tns:addResponse"/>
    </operation>
  </portType>
  <binding name="TransportCalculatorPortBinding" type="tns:TransportCalculator">
    <wsp1_2:PolicyReference URI="#TransportCalculatorPortBindingPolicy"/>
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="add">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="TransportCalculatorService">
    <port name="TransportCalculatorPort" binding="tns:TransportCalculatorPortBinding">
      <soap:address location="https://localhost:8443/metro-soap-calculator/TransportCalculator"/>
    </port>
  </service>
</definitions>

